{"id":2199,"date":"2021-09-09T16:39:21","date_gmt":"2021-09-09T23:39:21","guid":{"rendered":"https:\/\/sticker.ninja\/?page_id=2199"},"modified":"2024-05-17T09:28:10","modified_gmt":"2024-05-17T16:28:10","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/stickerninja.com\/terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"<p>Last updated: July 19, 2021<\/p>\n<p>Please read these terms and conditions carefully before using Our Service.<\/p>\n<h1>Interpretation and Definitions<\/h1>\n<h2>Interpretation<\/h2>\n<p>The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.<\/p>\n<h2>Definitions<\/h2>\n<p>For the purposes of these Terms and Conditions:<\/p>\n<ul>\n<li><strong>Affiliate<\/strong> means an entity that controls, is controlled by or is under common control with a party, where &#8220;control&#8221; means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.<\/li>\n<li><strong>Account<\/strong> means a unique account created for You to access our Service or parts of our Service.<\/li>\n<li><strong>Country<\/strong> refers to: Oregon, United States<\/li>\n<li><strong>Company<\/strong> (referred to as either &#8220;the Company&#8221;, &#8220;We&#8221;, &#8220;Us&#8221; or &#8220;Our&#8221; in this Agreement) refers to Dream Ninjas LLC, 4784 SE 17th Ave Unit #155, Portland, OR 97202.<\/li>\n<li><strong>Content<\/strong> refers to content such as text, images, or other information that can be posted, uploaded, linked to or otherwise made available by You, regardless of the form of that content.<\/li>\n<li><strong>Device<\/strong> means any device that can access the Service such as a computer, a cellphone or a digital tablet.<\/li>\n<li><strong>Goods<\/strong> refer to the items offered for sale on the Service.<\/li>\n<li><strong>Orders<\/strong> mean a request by You to purchase Goods from Us.<\/li>\n<li><strong>Service<\/strong> refers to the Website.<\/li>\n<li><strong>Terms and Conditions<\/strong> (also referred as &#8220;Terms&#8221;) mean these Terms and Conditions that form the entire agreement between You and the Company regarding the use of the Service.<\/li>\n<li><strong>Third-party Social Media Service<\/strong> means any services or content (including data, information, products or services) provided by a third-party that may be displayed, included or made available by the Service.<\/li>\n<li><strong>Website<\/strong> refers to Sticker Ninja, accessible from <a href=\"www.stickerninja.com\" target=\"_blank\" rel=\"external nofollow noopener\">www.stickerninja.com<\/a><\/li>\n<li><strong>You<\/strong> means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.<\/li>\n<\/ul>\n<h1>Acknowledgment<\/h1>\n<p>These are the Terms and Conditions governing the use of this Service and the agreement that operates between You and the Company. These Terms and Conditions set out the rights and obligations of all users regarding the use of the Service.<\/p>\n<p>Your access to and use of the Service is conditioned on Your acceptance of and compliance with these Terms and Conditions. These Terms and Conditions apply to all visitors, users and others who access or use the Service.<\/p>\n<p>By accessing or using the Service You agree to be bound by these Terms and Conditions. If You disagree with any part of these Terms and Conditions then You may not access the Service.<\/p>\n<p>You represent that you are over the age of 18. The Company does not permit those under 18 to use the Service.<\/p>\n<p>Your access to and use of the Service is also conditioned on Your acceptance of and compliance with the Privacy Policy of the Company. Our Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your personal information when You use the Application or the Website and tells You about Your privacy rights and how the law protects You. Please read Our Privacy Policy carefully before using Our Service.<\/p>\n<h1>Placing Orders for Goods<\/h1>\n<p>By placing an Order for Goods through the Service, You warrant that You are legally capable of entering into binding contracts.<\/p>\n<h2>Your Information<\/h2>\n<p>If You wish to place an Order for Goods available on the Service, You may be asked to supply certain information relevant to Your Order including, without limitation, Your name, Your email, Your phone number, Your credit card number, the expiration date of Your credit card, Your billing address, and Your shipping information.<\/p>\n<p>You represent and warrant that: (i) You have the legal right to use any credit or debit card(s) or other payment method(s) in connection with any Order; and that (ii) the information You supply to us is true, correct and complete.<\/p>\n<p>By submitting such information, You grant us the right to provide the information to payment processing third parties for purposes of facilitating the completion of Your Order.<\/p>\n<h2>Order Cancellation<\/h2>\n<p>We reserve the right to refuse or cancel Your Order at any time for certain reasons including but not limited to:<\/p>\n<ul>\n<li>Goods availability<\/li>\n<li>Errors in the description or prices for Goods<\/li>\n<li>Errors in Your Order<\/li>\n<\/ul>\n<p>We reserve the right to refuse or cancel Your Order if fraud or an unauthorized or illegal transaction is suspected.<\/p>\n<h3>Your Order Cancellation Rights<\/h3>\n<p>Any Goods you purchase can only be returned in accordance with these Terms and Conditions and Our Returns Policy.<\/p>\n<p>Our Returns Policy forms a part of these Terms and Conditions. Please read our Returns Policy to learn more about your right to cancel Your Order.<\/p>\n<p>Your right to cancel an Order only applies to Goods that are returned in the same condition as You received them. You should also include all of the products instructions, documents and wrappings. Goods that are damaged or not in the same condition as You received them or which are worn simply beyond opening the original packaging will not be refunded. You should therefore take reasonable care of the purchased Goods while they are in Your possession.<\/p>\n<p>We will reimburse You no later than 14 days from the day on which We receive the returned Goods. We will use the same means of payment as You used for the Order, and You will not incur any fees for such reimbursement.<\/p>\n<p>You will not have any right to cancel an Order for the supply of any of the following Goods:<\/p>\n<ul>\n<li>The supply of Goods made to Your specifications or clearly personalized.<\/li>\n<li>The supply of Goods which according to their nature are not suitable to be returned, deteriorate rapidly or where the date of expiry is over.<\/li>\n<li>The supply of Goods which are not suitable for return due to health protection or hygiene reasons and were unsealed after delivery.<\/li>\n<li>The supply of Goods which are, after delivery, according to their nature, inseparably mixed with other items.<\/li>\n<li>The supply of digital content which is not supplied on a tangible medium if the performance has begun with Your prior express consent and You have acknowledged Your loss of cancellation right.<\/li>\n<\/ul>\n<h2>Availability, Errors and Inaccuracies<\/h2>\n<p>We are constantly updating Our offerings of Goods on the Service. The Goods available on Our Service may be mispriced, described inaccurately, or unavailable, and We may experience delays in updating information regarding our Goods on the Service and in Our advertising on other websites.<\/p>\n<p>We cannot and do not guarantee the accuracy or completeness of any information, including prices, product images, specifications, availability, and services. We reserve the right to change or update information and to correct errors, inaccuracies, or omissions at any time without prior notice.<\/p>\n<h2>Prices Policy<\/h2>\n<p>The Company reserves the right to revise its prices at any time prior to accepting an Order.<\/p>\n<p>The prices quoted may be revised by the Company subsequent to accepting an Order in the event of any occurrence affecting delivery caused by government action, variation in customs duties, increased shipping charges, higher foreign exchange costs and any other matter beyond the control of the Company. In that event, You will have the right to cancel Your Order.<\/p>\n<h2>Payments<\/h2>\n<p>All Goods purchased are subject to a one-time payment. Payment can be made through various payment methods we have available, such as Visa, MasterCard, Affinity Card, American Express cards or online payment methods (PayPal, for example).<\/p>\n<p>Payment cards (credit cards or debit cards) are subject to validation checks and authorization by Your card issuer. If we do not receive the required authorization, We will not be liable for any delay or non-delivery of Your Order.<\/p>\n<h1>User Accounts<\/h1>\n<p>When You create an account with Us, You must provide Us information that is accurate, complete, and current at all times. Failure to do so constitutes a breach of the Terms, which may result in immediate termination of Your account on Our Service.<\/p>\n<p>You are responsible for safeguarding the password that You use to access the Service and for any activities or actions under Your password, whether Your password is with Our Service or a Third-Party Social Media Service.<\/p>\n<p>You agree not to disclose Your password to any third party. You must notify Us immediately upon becoming aware of any breach of security or unauthorized use of Your account.<\/p>\n<p>You may not use as a username the name of another person or entity or that is not lawfully available for use, a name or trademark that is subject to any rights of another person or entity other than You without appropriate authorization, or a name that is otherwise offensive, vulgar or obscene.<\/p>\n<h1>Content<\/h1>\n<h2>Your Right to Post Content<\/h2>\n<p>Our Service allows You to post Content. You are responsible for the Content that You post to the Service, including its legality, reliability, and appropriateness.<\/p>\n<p>By posting Content to the Service, You grant Us the right and license to use, modify, publicly perform, publicly display, reproduce, and distribute such Content on and through the Service. You retain any and all of Your rights to any Content You submit, post or display on or through the Service and You are responsible for protecting those rights. You agree that this license includes the right for Us to make Your Content available to other users of the Service, who may also use Your Content subject to these Terms.<\/p>\n<p>You represent and warrant that: (i) the Content is Yours (You own it) or You have the right to use it and grant Us the rights and license as provided in these Terms, and (ii) the posting of Your Content on or through the Service does not violate the privacy rights, publicity rights, copyrights, contract rights or any other rights of any person.<\/p>\n<h2>Content Restrictions<\/h2>\n<p>The Company is not responsible for the content of the Service&#8217;s users. You expressly understand and agree that You are solely responsible for the Content and for all activity that occurs under your account, whether done so by You or any third person using Your account.<\/p>\n<p>You may not transmit any Content that is unlawful, offensive, upsetting, intended to disgust, threatening, libelous, defamatory, obscene or otherwise objectionable. Examples of such objectionable Content include, but are not limited to, the following:<\/p>\n<ul>\n<li>Unlawful or promoting unlawful activity.<\/li>\n<li>Defamatory, discriminatory, or mean-spirited content, including references or commentary about religion, race, sexual orientation, gender, national\/ethnic origin, or other targeted groups.<\/li>\n<li>Spam, machine – or randomly – generated, constituting unauthorized or unsolicited advertising, chain letters, any other form of unauthorized solicitation, or any form of lottery or gambling.<\/li>\n<li>Containing or installing any viruses, worms, malware, trojan horses, or other content that is designed or intended to disrupt, damage, or limit the functioning of any software, hardware or telecommunications equipment or to damage or obtain unauthorized access to any data or other information of a third person.<\/li>\n<li>Infringing on any proprietary rights of any party, including patent, trademark, trade secret, copyright, right of publicity or other rights.<\/li>\n<li>Impersonating any person or entity including the Company and its employees or representatives.<\/li>\n<li>Violating the privacy of any third person.<\/li>\n<li>False information and features.<\/li>\n<\/ul>\n<p>The Company reserves the right, but not the obligation, to, in its sole discretion, determine whether or not any Content is appropriate and complies with this Terms, refuse or remove this Content. The Company further reserves the right to make formatting and edits and change the manner any Content. The Company can also limit or revoke the use of the Service if You post such objectionable Content.<br \/>\nAs the Company cannot control all content posted by users and\/or third parties on the Service, you agree to use the Service at your own risk. You understand that by using the Service You may be exposed to content that You may find offensive, indecent, incorrect or objectionable, and You agree that under no circumstances will the Company be liable in any way for any content, including any errors or omissions in any content, or any loss or damage of any kind incurred as a result of your use of any content.<\/p>\n<h2>Content Backups<\/h2>\n<p>Although regular backups of Content are performed, the Company do not guarantee there will be no loss or corruption of data.<\/p>\n<p>Corrupt or invalid backup points may be caused by, without limitation, Content that is corrupted prior to being backed up or that changes during the time a backup is performed.<\/p>\n<p>The Company will provide support and attempt to troubleshoot any known or discovered issues that may affect the backups of Content. But You acknowledge that the Company has no liability related to the integrity of Content or the failure to successfully restore Content to a usable state.<\/p>\n<p>You agree to maintain a complete and accurate copy of any Content in a location independent of the Service.<\/p>\n<h1>Copyright Policy<\/h1>\n<h2>Intellectual Property Infringement<\/h2>\n<p>We respect the intellectual property rights of others. It is Our policy to respond to any claim that Content posted on the Service infringes a copyright or other intellectual property infringement of any person.<\/p>\n<p>If You are a copyright owner, or authorized on behalf of one, and You believe that the copyrighted work has been copied in a way that constitutes copyright infringement that is taking place through the Service, You must submit Your notice in writing to the attention of our copyright agent via email at support@stickerninja.com and include in Your notice a detailed description of the alleged infringement.<\/p>\n<p>You may be held accountable for damages (including costs and attorneys&#8217; fees) for misrepresenting that any Content is infringing Your copyright.<\/p>\n<h2>DMCA Notice and DMCA Procedure for Copyright Infringement Claims<\/h2>\n<p>You may submit a notification pursuant to the Digital Millennium Copyright Act (DMCA) by providing our Copyright Agent with the following information in writing (see 17 U.S.C 512(c)(3) for further detail):<\/p>\n<ul>\n<li>An electronic or physical signature of the person authorized to act on behalf of the owner of the copyright&#8217;s interest.<\/li>\n<li>A description of the copyrighted work that You claim has been infringed, including the URL (i.e., web page address) of the location where the copyrighted work exists or a copy of the copyrighted work.<\/li>\n<li>Identification of the URL or other specific location on the Service where the material that You claim is infringing is located.<\/li>\n<li>Your address, telephone number, and email address.<\/li>\n<li>A statement by You that You have a good faith belief that the disputed use is not authorized by the copyright owner, its agent, or the law.<\/li>\n<li>A statement by You, made under penalty of perjury, that the above information in Your notice is accurate and that You are the copyright owner or authorized to act on the copyright owner&#8217;s behalf.<\/li>\n<\/ul>\n<p>You can contact our copyright agent via email at support@stickerninja.com.<br \/>\nUpon receipt of a notification, the Company will take whatever action, in its sole discretion, it deems appropriate, including removal of the challenged content from the Service.<\/p>\n<h1>Links to Other Websites<\/h1>\n<p>Our Service may contain links to third-party web sites or services that are not owned or controlled by the Company.<\/p>\n<p>The Company has no control over, and assumes no responsibility for, the content, privacy policies, or practices of any third party web sites or services. You further acknowledge and agree that the Company shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such content, goods or services available on or through any such web sites or services.<\/p>\n<p>We strongly advise You to read the terms and conditions and privacy policies of any third-party web sites or services that You visit.<\/p>\n<h1>Termination<\/h1>\n<p>We may terminate or suspend Your Account immediately, without prior notice or liability, for any reason whatsoever, including without limitation if You breach these Terms and Conditions.<\/p>\n<p>Upon termination, Your right to use the Service will cease immediately. If You wish to terminate Your Account, You may simply discontinue using the Service.<\/p>\n<h1>Limitation of Liability<\/h1>\n<p>Notwithstanding any damages that You might incur, the entire liability of the Company and any of its suppliers under any provision of this Terms and Your exclusive remedy for all of the foregoing shall be limited to the amount actually paid by You through the Service or 100 USD if You haven&#8217;t purchased anything through the Service.<\/p>\n<p>To the maximum extent permitted by applicable law, in no event shall the Company or its suppliers be liable for any special, incidental, indirect, or consequential damages whatsoever (including, but not limited to, damages for loss of profits, loss of data or other information, for business interruption, for personal injury, loss of privacy arising out of or in any way related to the use of or inability to use the Service, third-party software and\/or third-party hardware used with the Service, or otherwise in connection with any provision of this Terms), even if the Company or any supplier has been advised of the possibility of such damages and even if the remedy fails of its essential purpose.<\/p>\n<p>Some states do not allow the exclusion of implied warranties or limitation of liability for incidental or consequential damages, which means that some of the above limitations may not apply. In these states, each party&#8217;s liability will be limited to the greatest extent permitted by law.<\/p>\n<h1>&#8220;AS IS&#8221; and &#8220;AS AVAILABLE&#8221; Disclaimer<\/h1>\n<p>The Service is provided to You &#8220;AS IS&#8221; and &#8220;AS AVAILABLE&#8221; and with all faults and defects without warranty of any kind. To the maximum extent permitted under applicable law, the Company, on its own behalf and on behalf of its Affiliates and its and their respective licensors and service providers, expressly disclaims all warranties, whether express, implied, statutory or otherwise, with respect to the Service, including all implied warranties of merchantability, fitness for a particular purpose, title and non-infringement, and warranties that may arise out of course of dealing, course of performance, usage or trade practice. Without limitation to the foregoing, the Company provides no warranty or undertaking, and makes no representation of any kind that the Service will meet Your requirements, achieve any intended results, be compatible or work with any other software, applications, systems or services, operate without interruption, meet any performance or reliability standards or be error free or that any errors or defects can or will be corrected.<\/p>\n<p>Without limiting the foregoing, neither the Company nor any of the company&#8217;s provider makes any representation or warranty of any kind, express or implied: (i) as to the operation or availability of the Service, or the information, content, and materials or products included thereon; (ii) that the Service will be uninterrupted or error-free; (iii) as to the accuracy, reliability, or currency of any information or content provided through the Service; or (iv) that the Service, its servers, the content, or e-mails sent from or on behalf of the Company are free of viruses, scripts, trojan horses, worms, malware, timebombs or other harmful components.<\/p>\n<p>Some jurisdictions do not allow the exclusion of certain types of warranties or limitations on applicable statutory rights of a consumer, so some or all of the above exclusions and limitations may not apply to You. But in such a case the exclusions and limitations set forth in this section shall be applied to the greatest extent enforceable under applicable law.<\/p>\n<h1>Governing Law<\/h1>\n<p>The laws of the Country, excluding its conflicts of law rules, shall govern this Terms and Your use of the Service. Your use of the Application may also be subject to other local, state, national, or international laws.<\/p>\n<h1>Disputes Resolution<\/h1>\n<p>If You have any concern or dispute about the Service, You agree to first try to resolve the dispute informally by contacting the Company.<\/p>\n<h1>For European Union (EU) Users<\/h1>\n<p>If You are a European Union consumer, you will benefit from any mandatory provisions of the law of the country in which you are resident in.<\/p>\n<h1>United States Legal Compliance<\/h1>\n<p>You represent and warrant that (i) You are not located in a country that is subject to the United States government embargo, or that has been designated by the United States government as a &#8220;terrorist supporting&#8221; country, and (ii) You are not listed on any United States government list of prohibited or restricted parties.<\/p>\n<h1>Severability and Waiver<\/h1>\n<h2>Severability<\/h2>\n<p>If any provision of these Terms is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law and the remaining provisions will continue in full force and effect.<\/p>\n<h2>Waiver<\/h2>\n<p>Except as provided herein, the failure to exercise a right or to require performance of an obligation under this Terms shall not effect a party&#8217;s ability to exercise such right or require such performance at any time thereafter nor shall be the waiver of a breach constitute a waiver of any subsequent breach.<\/p>\n<h1>Translation Interpretation<\/h1>\n<p>These Terms and Conditions may have been translated if We have made them available to You on our Service.<br \/>\nYou agree that the original English text shall prevail in the case of a dispute.<\/p>\n<h1>Changes to These Terms and Conditions<\/h1>\n<p>We reserve the right, at Our sole discretion, to modify or replace these Terms at any time. If a revision is material We will make reasonable efforts to provide at least 30 days&#8217; notice prior to any new terms taking effect. What constitutes a material change will be determined at Our sole discretion.<\/p>\n<p>By continuing to access or use Our Service after those revisions become effective, You agree to be bound by the revised terms. If You do not agree to the new terms, in whole or in part, please stop using the website and the Service.<\/p>\n<h1>Contact Us<\/h1>\n<p>If you have any questions about these Terms and Conditions, You can contact us:<\/p>\n<ul>\n<li>By email: support@stickerninja.com<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Last updated: July 19, 2021 Please read these terms and conditions carefully before using Our Service. Interpretation and Definitions Interpretation The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural. Definitions &hellip; <a href=\"https:\/\/stickerninja.com\/terms-and-conditions\/\">Continued<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-2199","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v22.2 (Yoast SEO v24.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms and Conditions - Sticker Ninja<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/stickerninja.com\/terms-and-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms and Conditions - Sticker Ninja\" \/>\n<meta property=\"og:description\" content=\"Last updated: July 19, 2021 Please read these terms and conditions carefully before using Our Service. Interpretation and Definitions Interpretation The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural. Definitions &hellip; Continued\" \/>\n<meta property=\"og:url\" content=\"https:\/\/stickerninja.com\/terms-and-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Sticker Ninja\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-17T16:28:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/stickerninja.com\/wp-content\/uploads\/2021\/07\/logo-dark.png\" \/>\n\t<meta property=\"og:image:width\" content=\"747\" \/>\n\t<meta property=\"og:image:height\" content=\"411\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"16 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/stickerninja.com\/terms-and-conditions\/\",\"url\":\"https:\/\/stickerninja.com\/terms-and-conditions\/\",\"name\":\"Terms and Conditions - Sticker Ninja\",\"isPartOf\":{\"@id\":\"https:\/\/stickerninja.com\/#website\"},\"datePublished\":\"2021-09-09T23:39:21+00:00\",\"dateModified\":\"2024-05-17T16:28:10+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/stickerninja.com\/terms-and-conditions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/stickerninja.com\/terms-and-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/stickerninja.com\/terms-and-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/stickerninja.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Terms and Conditions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/stickerninja.com\/#website\",\"url\":\"https:\/\/stickerninja.com\/\",\"name\":\"Sticker Ninja\",\"description\":\"Custom Stickers and Labels\",\"publisher\":{\"@id\":\"https:\/\/stickerninja.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/stickerninja.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/stickerninja.com\/#organization\",\"name\":\"Sticker Ninja\",\"url\":\"https:\/\/stickerninja.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/stickerninja.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/stickerninja.com\/wp-content\/uploads\/2021\/07\/logo-dark.png\",\"contentUrl\":\"https:\/\/stickerninja.com\/wp-content\/uploads\/2021\/07\/logo-dark.png\",\"width\":747,\"height\":411,\"caption\":\"Sticker Ninja\"},\"image\":{\"@id\":\"https:\/\/stickerninja.com\/#\/schema\/logo\/image\/\"}}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Terms and Conditions - Sticker Ninja","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/stickerninja.com\/terms-and-conditions\/","og_locale":"en_US","og_type":"article","og_title":"Terms and Conditions - Sticker Ninja","og_description":"Last updated: July 19, 2021 Please read these terms and conditions carefully before using Our Service. Interpretation and Definitions Interpretation The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural. Definitions &hellip; Continued","og_url":"https:\/\/stickerninja.com\/terms-and-conditions\/","og_site_name":"Sticker Ninja","article_modified_time":"2024-05-17T16:28:10+00:00","og_image":[{"width":747,"height":411,"url":"https:\/\/stickerninja.com\/wp-content\/uploads\/2021\/07\/logo-dark.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"16 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/stickerninja.com\/terms-and-conditions\/","url":"https:\/\/stickerninja.com\/terms-and-conditions\/","name":"Terms and Conditions - Sticker Ninja","isPartOf":{"@id":"https:\/\/stickerninja.com\/#website"},"datePublished":"2021-09-09T23:39:21+00:00","dateModified":"2024-05-17T16:28:10+00:00","breadcrumb":{"@id":"https:\/\/stickerninja.com\/terms-and-conditions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/stickerninja.com\/terms-and-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/stickerninja.com\/terms-and-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/stickerninja.com\/"},{"@type":"ListItem","position":2,"name":"Terms and Conditions"}]},{"@type":"WebSite","@id":"https:\/\/stickerninja.com\/#website","url":"https:\/\/stickerninja.com\/","name":"Sticker Ninja","description":"Custom Stickers and Labels","publisher":{"@id":"https:\/\/stickerninja.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/stickerninja.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/stickerninja.com\/#organization","name":"Sticker Ninja","url":"https:\/\/stickerninja.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/stickerninja.com\/#\/schema\/logo\/image\/","url":"https:\/\/stickerninja.com\/wp-content\/uploads\/2021\/07\/logo-dark.png","contentUrl":"https:\/\/stickerninja.com\/wp-content\/uploads\/2021\/07\/logo-dark.png","width":747,"height":411,"caption":"Sticker Ninja"},"image":{"@id":"https:\/\/stickerninja.com\/#\/schema\/logo\/image\/"}}]}},"_links":{"self":[{"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/pages\/2199","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/comments?post=2199"}],"version-history":[{"count":6,"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/pages\/2199\/revisions"}],"predecessor-version":[{"id":38959,"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/pages\/2199\/revisions\/38959"}],"wp:attachment":[{"href":"https:\/\/stickerninja.com\/wp-json\/wp\/v2\/media?parent=2199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}